package domains

var _region = []string{
	"", "北海道", "青森県", "岩手県", "宮城県",
	"秋田県", "山形県", "福島県", "茨城県", "栃木県",
	"群馬県", "埼玉県", "千葉県", "東京都", "神奈川県",
	"新潟県", "富山県", "石川県", "福井県", "山梨県",
	"長野県", "岐阜県", "静岡県", "愛知県", "三重県",
	"滋賀県", "京都府", "大阪府", "兵庫県", "奈良県",
	"和歌山県", "鳥取県", "島根県", "岡山県", "広島県",
	"山口県", "徳島県", "香川県", "愛媛県", "高知県",
	"福岡県", "佐賀県", "長崎県", "熊本県", "大分県",
	"宮崎県", "鹿児島県", "沖縄県",
}

var _regionKana = []string{
	"", "ホッカイドウ", "アオモリケン", "イワテケン", "ミヤギケン",
	"アキタケン", "ヤマガタケン", "フクシマケン", "イバラキケン", "トチギケン",
	"グンマケン", "サイタマケン", "チバケン", "トウキョウト", "カナガワケン",
	"ニイガタケン", "トヤマケン", "イシカワケン", "フクイケン", "ヤマナシケン",
	"ナガノケン", "ギフケン", "シズオカケン", "アイチケン", "ミエケン",
	"シガケン", "キョウトフ", "オオサカフ", "ヒョウゴケン", "ナラケン",
	"ワカヤマケン", "トットリケン", "シマネケン", "オカヤマケン", "ヒロシマケン",
	"ヤマグチケン", "トクシマケン", "カガワケン", "エヒメケン", "コウチケン",
	"フクオカケン", "サガケン", "ナガサキケン", "クマモトケン", "オオイタケン",
	"ミヤザキケン", "カゴシマケン", "オキナワケン",
}

func Region(index int) Prefecture {
	if index < 0 || index >= len(_region) {
		return ""
	}
	return Prefecture(_region[index])
}

func RegionKana(index int) string {
	if index < 0 || index >= len(_region) {
		return ""
	}
	return _regionKana[index]
}

type Prefecture string

func (p Prefecture) Id() int {
	for i, r := range _region {
		if r == string(p) {
			return i
		}
	}
	return 0
}

func (p Prefecture) Kana() string {
	return RegionKana(p.Id())
}
